{"avatar": ["A disabled man gets to save the world because his brother died.", "Paralyzed guy falls in love with a woman but he’s not who he says he is and people die and trees burn down."], "the green mile ": ["A man gets his dick grabbed by a bigger man in jail. This improves his sex life."], "lego movie": ["Construction worker saves the world from evil billionaire."], "a star is born the new one": ["A grown man is so embarrassed after pissing his pants in public that he kills himself."], "back to the future iii ": ["Clint Eastwood destroys an old man's car forcing the old man to ride the train."], "fight club": ["A man and his new best friend create a support group and end up changing the world"], "fifth element": ["Man flies to floating hotel to save the world with love."], "mad max fury road": ["Man of few words hitches a ride only to end up going back where the trip began", "Man goes on roadtrip, escapades happen, he encounters a demolition derby, wins and walks away at the end of the movie"], "arrested development ": ["[TV] in this one no one ever learns a lesson"], "hell fest": ["Girl gets scared by a man a couple times at a scary theme park."], "toy story": ["A sadist tortures a cowboy to breaking point.", "Tom Hanks and Tim Allen escape a hostage situation by mentally scarring a child and outsmarting his dog."], "big": ["Kind of Shazam but the guy becomes an executive instead of a superhero!"], "pulp fiction": ["Man who lives in a box, fails to warn his landlords about the escaped swordsman."], "lady bird": ["A catholic school girl lives her life"], "the hangover ": ["Group of friends win it big in a Roman castle"], "reservoir dogs": ["A group of colorful individuals commit armed robbery.", "4 persons of color struggle to figure out which of them isn't commited to their cause", "A group of colleagues have coffee together before a bad day at work; most of them end up getting fired."], "monsters vs aliens": ["A woman who is taller than average learns she doesn’t need a man and defeats a multi limbed blue guy.", "Huge girl with white hair destroys aliens."], "kingdom of heaven": ["A small business owner goes on a road trip with dad. Dad dies on trip and now he owns a property in far away land. Becomes a soldier but loses a battle and goes back to his business."], "rocky": ["Illiterate ball bouncer punches his way to the top!"], "snowpiercer you know what i hate about myself i know what people taste like ": ["Human Torch becomes a terrorist in a world fucked up by chemtrails"], "the bone collector": ["Man who can’t get out of bed, gets girl to solve crimes instead."], "total recall": ["Man kills his wife, taxi driver and boss for a breath of fresh air.", "A dude with split personalities leaves his wife for a stripper."], "edge of tomorrow": ["Man keeps doing the same thing until he succeeds. This timeless adventure will keep you all on the edge of your seat.", "It’s like groundhogs day only aliens are causing it"], "weird science": ["2 youths combine their love for computers with their disregard for the proper usage of women's lingerie to find themselves involved with a woman that make showering with your pants on seem cool.", "Two high schoolers take 3D printing to the next level"], "kenny vs spenny": ["A diabolical dirty clever edgelord vs a clean arrogant violent guy"], "et ": ["Kids help a foreigner call their home."], "the lego movie ": ["A business man weaponizes glue"], "darkman": ["Dude blows himself up, becomes obsessed with cosplay."], "dredd": ["A pair of cops shoot up an apartment complex."], "la confidential": ["A cop arrests the wrong guy, shoots his boss and gets a medal for it."], "pulp fiction ": ["A man quotes scripture to someone whose linguistic skills are in question."], "iron man": ["Dude blows himself up, gets obsessed with body mods.", "Rich Guy builds Suit", "The CEO of a company kills a corporate saboteur and covers it up with the help of the government.", "A man saves the world in a badass homemade costume"], "speed": ["Guess it boss"], "kubo and the two strings": ["A kid with a broken instrument sets out to escape his crazy aunties with a bug and a monkey."], "aliens  ": ["The queen sends her soldiers to attack a colony"], "this must be revenant": ["Man crawls and grunts for two and half hours"], "psych": ["[TV] A man’s friend is arrested because his attention to detail made his anonymous tip too good, so he goes along with his friend’s fake detective antics to keep him out of jail."], "if the emperor had a texttospeech device \n\nseems like this one was just a way to expose fans of 40k memes ": ["(Web Series) Paradox Billiards Vostroyan Roulette Fourth-Dimensional Hypercube Chess Strip Poker"], "matrix ": ["A man is approached by a gang of people living double lives, who confirm what he's always felt - that the whole world is one big lie. With their help, he becomes the best liar *ever*, and saves them all."], "thor ragnarok": ["Man is stuck as prisoner in a foreign land while his homeland is going through a dictatorship and civil war", "A god meets his big dick friend in another planet", "Family reunion with sister doesn't go well for brothers."], "doctor strange": ["Man drinks tea, becomes obsessed with a green apple jolly rancher."], "death note": ["[Anime] College students try to one up each other with monologues"], "dune": ["Transparent man takes his family on vacation only to find out his son is Jesus or something. Oh yeah, and some creepy lady has a knife and threatens the kid with it for some reason, I dunno, it was all a bit confusing."], "gun gale online": ["[Anime] A girl who’s obsessed with death taunts a girl who is way too attached to her gun."], "aggretsuko ": ["[TV] Petite office worker by day, heavy metal furry by night"], "the legend of zelda breath of the wild": ["[GAME] Guy wakes up from a 100 year nap to fight a pig"], "diary of a wimpy kid\n\nx200b": ["[Book] Sociopath writes a journal about cheese."], "paul blart mall cop": ["Man hides in Vents, eats gross lollipop, and saves hostages.", "An officer of the law must fight his apprentice and hypoglycemia during the holidays"], "my name is earl": ["[SHOW] Criminal guilts mentally-challenged brother into doing chores with him"], "coco": ["Some guy is really hopeful that his daughter will die so he can see her."], "avatar the last airbender": ["[TV] Kid with strong lungs becomes an icicle."], "paul": ["Cool looking guy is locked up with some uptight mad scientist types, trades that bunch of nerds for a couple others, makes everyone look stupid, and goes home happy", "2 British men find Roger from American Dad and try to get him to his home planet"], "if not for accidentally id say die hard": ["Bald man hides in Vent and accidentally saves the day."], "aquaman": ["The shape of water and the sword in the stone at the same time", "A two-legged little mermaid and true king of the sea are in search of an oversized fork to use for combat against evil in the sea."], "mario the movie": ["Man meets reptilian lady, ends up overthrowing a government"], "looper ": ["A recovering drug addict trys to kill himself at a diner."], "valkyrie \n\nim just trying to think about plottoassassinatehitler movies": ["A group of misfits try to kill a painter"], "predestination": ["A man is his own grandpa.", "A man fucks himself and fails to properly disarm a bomb he armed earlier.", "Man has to become his own mom and dad to stop a terrorist."], "what about bob": ["A mentally ill man and his fish infiltrate another man's family and turn them against him."], "terminator": ["Man has sex with his best friend's mom", "Stalker tries to murder a woman he found in a phone book"], "is he dead": ["[Theater] Starving Frenchman is convinced to woo his debt collector by faking death, and posing as his surviving twin sister."], "ready player one": ["atheist kid looks for an egg", "Guy plays vr chat with his friends and they win a contest"], "warm bodies": ["Guy stricken with wanderlust has a girl's boyfriend over for lunch and then gets the hots for her"], "adventure time": ["(Show) two brothers travel around a wasteland meeting quite literal colorful characters.", "[TV] Post-apocalyptic World with deformed human goes in non-sensical journeys"], "unfortunate something something neil patrick harris": ["[Show] adults are dicks and idiots"], "young frankenstein": ["Scientist cheats on his fiancée with lab assistant, fiancée cheats back by becoming a necrophiliac", "A scientist fulfills his grandfather’s destiny but loses his mind in the process."], "garfield a tale of two kitties": ["A British Monarch gets swapped with an obese tourist"], "monty python and the holy grail": ["The French Are Saved From Invasion By The Police", "King gets arrested after being ridiculed, bested, mocked, and almost killed by a wild animal.", "*Since nobody guessed the movie in my original post, here it is again*- Police officers track down and arrest religious fundamentalists for the murder of a journalist.", "Police officers hunt down armed religious fundamentalists after the murder a journalist.", "A high ranking officer is attacked by his superior and he is only scratched"], "scott pilgrim vs the world": ["Bass Player Kills 7 Innocent Civilians", "Indie musician's new girlfriend's emotional baggage nearly kills him several times."], "jumanji the new one": ["Gamer is magically transformed into a minority"], "rocky horror picture show": ["Two ordinary people get mixed up in a convention and get brainwashed, dressed up to perform for an audience and frozen"], "hitchhikers guide to the galaxy": ["He's lost his home. Twice, now he's travelling around with an author, someone who changed their name and a half-brained idiot looking for something important"], "contact ": ["They have opened lines of communication, but using one of the worse people in history to do it"], "the day the earth stood still": ["A visitor arrives telling us of an impending invasion if things don't change, and brings along a friend to prove his point", "The US Army fights a giant iron man while an alien becomes friends with a government scientist to save the world"], "logans run ": ["Two people run for their lives because they don't want to get old"], "also monty python and the holy grail": ["Man Has Several Limbs Amputated, But Never Loses His Spirit"], "the name of the rose": ["An investigator and his protege go to a meeting and end up investigating a series of murders, bucking the rule of the land to do so"], "outlander": ["Estranged family separated by time, bond over rape [television series]"], "jaws ": ["A fishing trip goes very wrong."], "mr right": ["He used to be paid to take care of people, but now he takes care of the people who hire him, and he's a pretty good dancer"], "bugs life": ["Magnificent Seven, but tinier."], "planet 51": ["Alien Invasion in Reverse"], "enemy at the gates": ["German dude with American accent is looking for a Russian guy with a British accent."], "regular show": ["(Show) the name is the complete opposite off what it is"], "a new hope": ["Religious leader radicalizes youth and convince him of flying a plane into a large piece of infrastructure, killing any innocent people inside."], "hunt for red october ": ["Russians betraying Russians in the water"], "get out": ["A person pulls out of having brain surgery, even though the whole film built towards their operation.", "A couple have a debate about race at the girl’s parents house and he murders everyone in the end"], "i dont know who david radcliffe is but daniel radcliffe was in a movie called swiss army man that seems to fit the bill": ["David Radcliffe farts constantly and it's super helpful."], "smooth criminal annie are you okay": ["[SONG] Man constantly repeats a question to a dead person"], "how to train your dragon": ["Kid makes town love reptiles", "A black cripple serves a white kid and is forced to enslave his own kind."], "joes apartment ": ["Cockroaches go sewr surfing"], "how the grinch stole christmas": ["Man commits grand Larceny then eats food with the town."], "short circuit 2": ["A hero with minutes to live, uses a crane to pursue and capture a grouch."], "the force awakens": ["An Indoctrinated Warrior Joins A Closeted Mary Sue in High Treason"], "hp and the prisoner of azkaban": ["Good rat turns out to be a child murdering fuckwad."], "heavy rainhttpsyoutubedahg9d9uo7c": ["SHAUN?"], "walle": ["Rumba and Apple Mac save the planet from trash."], "steven universe": ["[Series] Lesbians raise a boy and protect him from other lesbians"], "the good dinosaur": ["A father dies after his son refuses to kill a human child"], "man of steel": ["Farm kid’s homeboy comes to town but can’t adjust to the big city"], "the mask": ["A man tries to save a man after being dumped by his best friend, he later becomes a silly Hulk."], "brazil": ["Low-level government employee's girlfriend dies again after he kills her, then he wins by losing"], "the lego movie": ["Man leaves dystopian society with an emo, an orphan, and a blind man with a lollipop to save the world from glue"], "halloween 3": ["Mind numbing TV advert proves fatal."], "anastasia": ["Amnesiac orphan travels to Paris"], "is it batman begins ": ["A traumatized animalkin psychopath fights a mental doctor and his boss"], "powerpuff girls ": ["Chemist tries to make food(?), and makes humans."], "fun with dick and jane": ["Enron the movie, but with happy ending."], "rocky iv": ["Italian punches man in the face so hard he ends the Cold War."], "real steel ": ["We moved on technologically, but we still participate in the same sports"], "watchmen": ["Man successfully dupes God in order to nuke Manhattan", "Guy decides to save world because he learns his ex's father was his dead teammate.", "a comedian died in New York and Somebody knows why", "Man doesn't understand humanity, ends up killing a few of his friends"], "revenge of the sith ": ["A virgin monk breaks his vows and gets laid, then proceeds to help slaughter all or the other virgin monks."], "evil dead 3 army of darkness\n\nedit wrong sequel": ["Amputee blows up skeletons, stops a war."], "antman": ["Mad scientist deals with bug infestation in san Francisco"], "its seven psychopaths or in bruges dude colin farrells totes the ugly man": ["A good man, a bad man and an ugly man goes on an adventure."], "home alone": ["Neglected kid reduces local crime", "Woman listens to Polka for many hours straight to see her son.", "Incompetent bandits barely don't have head traumas in multiple ocasions"], "neon genesis evangelion": ["[Animated TV Series] Severely Traumatized Teenagers with an Oedipus Complex Save the World.", "[TV Series] Teenagers with an Oedipus Complex defend earth."], "se7en": ["A Detective Shoots A Man After Enquiring About A Box?"], "icarly": ["A high school girl and her underage friends make videos on the internet with her much older male relative."], "close encounters of the third kind ": ["Man is obsessed with national park.", "A man become obsessed with a mound and his wife leaves him"], "no wait ice age": ["Unlikely friends put that thing back where it came from"], "guardians of the galaxy": ["A dancing god learns the power of friendship", "Guy gets space rock from ancient planet this gets taken and group of people try to take rock back"], "no country for old men": ["A man with a bad haircut is obsessed with coin tosses."], "school of rock": ["A School Lets a Random Man Touch their Students"], "nfl for the halftime show": ["[TV Show] A bunch of stuck up celebrities let millions of people down."], "blackadder season 4": ["[TV] WW1 soldiers run out of coffee so they drink coffee made from mud with dandruff for sugar and saliva for cream"], "the dark crystal": ["Muppets but dark"], "secret life of walter mitty": ["Man goes on quest to find a picture of himself."], "rogue one": ["Team goes on a suicide mission that involves stealing the plans to a giant basketball", "Traitors waste their lives stealing plans for a governmental facility"], "back to the future": ["there's a dude with white hair and a lab coat who likes to make up tech words", "Guy tries to get his mother to date some other guy he knows"], "jurassic park": ["Disgruntled employee decides to leave his job, but due to his incompetence, misses out on his last paycheck.", "A history exhibit is poorly named based off of its events.", "A bad motherfucker gives a woman a hand."], "men in black ": ["Border security agents track down missing pet of dead immigrant"], "robocop\n\nyoure dead we killed you we killed you": ["A man back from the dead hunts down his killers and murders his former boss."], "the butterfly effect": ["A man with amnesia uses spell books to alter his life drastically"], "inifinity war": ["Space boy bad... must be stopped word in danger"], "dead poets society ": ["A poetry teacher is blamed for a students suicide"], "underdog": ["Another Goof Childhood Movie"], "the artist  ": ["One golden age ends and another begins but the quiet guy gets in step at the end"], "incredibles ii": ["Housewife gets her husband’s dream job, but gets double crossed by her new boss."], "the lost boys": ["Peer pressure and a desire to impress a girl is turning him into a monster. Can he resist the urge to purge his own humanity?"], "fallout 4": ["Before i find my son i need to decorate my personal gas station."], "percy jackson sea of monster": ["Kid with fancy pen tries to save tree"], "duel": ["man driving encounters a truck"], "nightmare before christmas ": ["A goth tries cultural appropriation", "Freak learns that he shouldn't try anything new and that he will only ever be a freak. Merry Christmas"], "shark tale": ["Beloved Movie From My Childhood", "Guy becomes best beast slayer, eventually comes out that he was a sham and wasn't that good"], "the lion king": ["It’s kinda “Bambi”, it’s kinda “Hamlet”—It’s “Bamlet”!"], "interstellar ": ["A girl saves the world because her father told her but at the same time he didn’t."], "the loved ones": ["That guy should’ve gone to the prom with her"], "bakugan": ["[series] kids can turn their balls into fierce monsters"], "team america world police": ["America saves the world from a very lonely dictator"], "every superhero movie with a male villain ever ": ["Superhero has to stop bad guy from doing evil thing"], "the green mile": ["An old man wastes several hours of an old woman's time in order to say how he got his pet."], "surfs up": ["I Recently Watched This Movie on DVD"], "zootopia ": ["A cop uses her mob connections to unravel a conspiracy."], "super size me": ["Guy is lovin’ it for a month."], "valhalla rising": ["Guy doesn’t talk or see good, him and his boy go to Canada probably, with some guys on a crusade"], "salad fingers": ["[Series] Schizophrenic British man murders people and grieves his brother who died in WW1"], "animator vs animation": ["[SHORT]Guy creates a force to be reckoned with, fails to tame it."], "transfotmers": ["Robots fight over a cube"], "monsters inc ": ["Two friends kidnap a child and are being hunted by an alien detection agency for a full day, until they’re caught and banished to another dimension. Then they come back through an inter dimensional portal and give the child back, so naturally, they’re totally forgiven."], "ratatouille": ["An immigrant commits multiple health code violations and gets a promotion."], "the big lebowski": ["Jewish dude and his American friend sell old chinese junk.", "Not Nazis Needle Nonchalant Ne-er-do-well"], "monday night football": ["[Series] Various birds, mammals, western frontiersmen, Native Americans, holy folk, ruffians, nationalists, industrialists, ancient mythical colossi, modern day machines, and colors personified all fight each other"], "city slickers": ["A middle aged guy takes his two friends on a wild adventure and comes back with a pet"], "scooby doo and the cyber chase": ["Video Game Programmer's game doesn't get the score he wanted. His rational response is to turn to murder."], "kill bill": ["After a bad break up, a lone woman vows to murder her former work colleagues.", "Woman kills two men who raped her, rides a pussy and goes on a quest to kill her former coworkers"], "a series of unfortunate events ": ["A fable where the lesson is that most people are incredibly stupid & unhelpful."], "lethal weapon4 i think its 4 but they run together in my mind ": ["Young cop afraid to tell senior cop he impregnated his daughter, but eventually does so accidently."], "big ": ["Boy grows up too fast"], "the prestige": ["Two guys see who can do their job better. End up committing multiple murders."], "greetings starfighter you have been recruited by the star league to defend the frontier against xur and the kodan armada": ["Beat a game, join the air force and defend the world"], "hot fuzz": ["Big man gets sent to small town because he's too good at his job", "Policeman goes to a small town and takes down a cult filled with old people"], "top gun": ["Fighter pilot is a jerk while sometimes the song that Sterling Archer sings gets played"], "happy death day": ["Groundhogs day but with mediocrity and murder"], "the wizard of oz": ["Girl who gets lost picks up some randoms when she has to travel to find the person who could get her home", "Two women fight over shoes, eventually resorting to kidnapping and coerced murder.", "Girl gets praised and rewarded after murdering two women"], "taken": ["He's old, he's retired, but if you get in his way, you're really gonna get hurt"], "pandorium": ["Thousands of people go on a long space voyage, if the cannibals don't get you the madness will."], "the mouse that roared": ["A small nation goes up against a big one, and wins"], "little miss sunshine ": ["Grandpa teaches his granddaughter to do a strip dance."], "the big lebowski ": ["A man pee’s on a rug. Misadventure ensues.", "All that for a rug."], "game of thrones ": ["Wow that wedding was a disaster", "everyone just fucking dies"], "father brown": ["[TV-UK] Dark deeds committed always end up revealed - not by incompetent officers, but by a pastor."], "grosse pointe blank": ["It's been 10 years, and he doesn't want to go back, but he does for work and it changes his life forever"], "gravity": ["Woman flies about in space for a bit then woofs and drops down to earth."], "goodnight mommy": ["Psycho kid hates his mom’s makeover and his bro keeps him company"], "under the skin": ["Succubus discovers she has no vagina."], "ferris bueller ": ["Educator takes a stand to fight truancy"], "narnia the lion the witch and the wardrobe": ["Strange, shirtless adult meets a very young, lonely girl and creepily insists on inviting her back to his home for “tea”. Then makes her drift off to sleep."], "avengers": ["New Friends actually work on a group project"], "dbs broly": ["An endangered species finds a survivor.", "Emperor decides he’s too short so he wages a war on his enemies to get taller"], "spiderman ": ["Teen wakes one day and is able to spew white stuff from his body."], "megamind": ["Escaped criminal kills an alien.", "Will Ferrell version of Superman, but told from the other point of view", "Anti-Pygmalion: Lonely man must destroy the companion he made in a moment of desperation.", "Refugee achieves what he always wanted, learns that it wasn't what he always wanted and introduces a problem of titanic scale - just to learn he never achieved the thing in the first place, and now has to deal with the problem he introduced"], "casablanca": ["National anthem inspires cynical alcoholic.", "A bar owner helps illegal immigrants evade the police and flee the country"], "doctor who  ": ["A series of young women get into vehicles with a sketchy stranger."], "titanic": ["Girl lets go after promising not to"], "cars 2 ": ["Crazy person from buttfuck nowhere is mistaken for a spy"], "the road": ["A dedicated Father will stop at nothing until he and his son visit the beach, but on the way, for the life of him, cannot help but try and kill his son."], "witch mountain movie thing the one with the rock and the two kids i cant remember its name it gets memed here and there": ["Paying 10,000 for a taxi"], "a simple favor": ["A mom goes full Nancy Drew, which leads to her best friend being hit by a car"], "a new hope\n\n edit he gets there but the destination is gone ": ["A man pays $17,000 for a space taxi but doesn’t ever actually get to his destination."], "gandhi": ["Man was a lawyer then decided to stop eating, which makes people really happy"], "the usual suspects": ["Bulletin board fish mug shot coffee cup"], "black panther": ["Special Ops warrior battles a recluse, terrorists, and family for the throne after the assassination of an isolationist monarch.", "Young man takes on his father's role only to be usurped by his cousin, who no one knew existed"], "disneys the black hole": ["Robot has the same name as one of the actors."], "groundhog day": ["Man finally gets to shag his coworker after decades", "man becomes a god but can't get the girl, then gets the girl and becomes mortal again."], "jumper bet you thought nobody else had seen that movie": ["Man learns to jump really far after falling into a pond, then gets chased by Samuel L Jackson"], "aladdin ": ["Thief lies to his love interest, enslaves others, breaks promises, and imprisons enemy, until finally he becomes ruler of the land"], "my hero academia": ["(anime) kid eats hair to get into school."], "dont hug me im scared": ["Man i love this kids show... WHAT THE FUCK IS GOING ON"], "the disastrous life of saiki k": ["(Anime) Pink hair dude is OP.", "A kid with pink hair tries his best not to destroy the world."], "wonder": ["(book/movie) ugly guy goes to school for the first time."], "fairy tail aye sir": ["A guy with a flying cat merts a gurl with an obsession with keys."], "logan": ["american guy named 'Donald' chase down mexican kids to the borders"], " wild wild west that will smith movie ": ["A lawman is so good at his job he ends up in a steam punk nightmare."], "american psycho": ["Man gets jealous of coworkers stationary, kills a bunch of people"], "glass": ["Nick Fury's Mother Is 15 Years Younger Than Him, John McClane Loses To A Puddle And Charles Xavier Spoils The Exorcist.", "A bald man has to fight 24 people"], "moulin rouge ": ["British man travels to France against his fathers wishes to show off his goods to a whore and has to duke it out with her partner"], "emperors new groove": ["The emperor of the Inca empire becomes a furry"], "the dark knight": ["Angry rich guy with a sore throat and eyeliner chases a crazy guy with lipstick and a bad dye job.", "Makeup enthusiast who has daddy issues is bad with working with others and enjoys performing magic tricks"], "ohohoh maybe the sandlot": ["A dog just wants to play fetch but everyone is too selfish to realize it"], "the truman show": ["A man breaks the 4th wall, though I suppose there aren't really countable walls in a dome.", "Movie"], "black butler": ["(Anime) An orphan struggling with grief decides the dark side is for him & summons other worldly help for a lethal price."], "inglourious basterds": ["Group of Jews fight back and take peculiar souvenirs/trophies."], "shaun of the dead i reckon": ["After a bad breakup, all he wants to do is get drunk, but the next morning, all hell has broken loose"], "uhf": ["Man who can't hold a job gets involved in a media war with rival. Befriends mentally challenged man with a strange obsession to an inanimate object. A penny saves the day."], "force awakens": ["Two friends are attacked by a man who wants to find his uncle"], "gravity falls ": ["[Cartoon] Two kids uncover a mystery with their con-man relative"], "pocahontas ": ["A tale of star crossed romance between two cultures. A man with the most common anonymous alias ever falls for the girl with a trash panda sidekick"], "that one where people are stupid  lazy and elected a moron president": ["A soldier and a prostitute work together to stop America from drowning their crops in salt."], "harry potter ": ["A abused kid goes to a new school and kills a teacher."], "percy jackson and the lightning theif": ["(Book)Two kids and a hippie furry travel across the country to deliver a tiny nuke"], "if you are calling best fucking boy ryota a neet im gonna be very angry ": ["[ANIME] The world ends because a NEET wont stop drawing anime long enough to actually go to school"], "fargo": ["Oh for Pete’s sake. I’m freezing, I’m pregnant and the last thing I need right now is a gosh darn used car.", "Man trades his spouses safety for a parking lot"], "no country for old men ": ["Having a bad hair day, I’m gonna murder you with air.", "Mentally challenged man with bad haircut goes on a murder spree in a desert for money held by a Vietnam vet."], "shark tale ": ["A boxer dies and a car-wash employee takes credit for his murder. He takes this a step further by faking the death of the boxer's vegan brother. He then befriends a mob boss and becomes the manager of his facility."], "ripd": ["A cop dies and gets recruited as a cop."], "scooby doo ": ["Gang solves mysteries"], "vertigo ": ["Dolly Zoom: The Movie!"], "space jam ": ["MJ has a bad trip"], "saiki kusuo no psi nan": ["[Anime] guy with superpowers deals with annoying people"], "hotline miami": ["[Game] Comatose furry dreams about ethnic cleansing."], "hamlet": ["Brother fucks ghost’s wife"], "withnail and i": ["Guy gets a haircut and a job after spurning a would-be lover and horrible weekend. The dopey roommate gets more alcoholic and tragic"], "the chronicles of narnia the lion the witch and the wardrobe": ["Four kids escape a war just to fight another war in a closet."], "horrible bosses": ["Guy blackmails a dentist Because he’s a good Fiancé"], "cowboy beebop": ["A cowboy and space cop work together to survive. Along the way, they meet new friends including an overly energetic redhead."], "tokyo ghoul": ["A boy who went through a transplant surgery by a phsycho doctor and now has to eat people to survive(anime)"], "into the spiderverse": ["(Explaining film scene badly)(Superhero movie) Teenager jumps off building after being ditched by friends", "New kid and a criminal who needs to get his life together send a pig home.", "Spider Infestation in the Big Apple.", "An assortment of strangers with similar fashion sense have beef with a scientist and a businessman."], "harry potter  the chamber of secrets": ["A member of a slave race tries to stop a twelve year old from going to school"], "thw first one i know avengers ": ["Steroid Abuser, PTSD sufferer, giant with anger issues, wothy blond guy, bird that can shoot arrows, and widow try to defeat mind controlled man"], "guardians of the galaxy 2": ["They could save the universe, if they could find tape."], "how to train your dragon ": ["Wimpy outcast befriends village enemy."], "batman v superman": ["Man is taken aback when enemy stumbles on his safeword"], "the blues brothers": ["Musicians cause millions of dollars in damage while on a religious journey"], "highlander": ["A bunch of swordsmen try to kill each other"], "jaws the revenge": ["A butler flies a plane and almost gets eaten by a shark."], "2001 a space odyssey": ["Pseudodocumentary about evolution."], "captain america civil war": ["A guy argues with his best friend over his other best friend", "Octogenarian has an argument with an old friend at the behest of the government"], "hook": ["Man pretends to be an adult for so long that he forgets to pretend.", "Old man relives his childhood and faces an old foe"], "rosencrantz and guildenstern are dead": ["A couple guys talk about existence while they don’t"], "zootopia\n\ngive my regards to grandmama": ["The mafia nearly kills a city worker and their acquaintance over a rug"], "monsters inc": ["Two friends working at a power supply station discover a little girl is trespassing and holding secrets that will bring down the company but they try to get her home and protect her from a malicious co worker who wants to kill her."], "infinity war": ["A bunch of dudes fight over some rocks."], "transformers ": ["Alien goes to earth to protect it from other aliens"], "the meg": ["BIG SHARKS now with less quotable lines"], "the magic school bus": ["[TV] A teacher and her whole class explore a young boy’s body"], "star trek ii the wrath of khan": ["Man with superpowers doesn't use any of them. Steals a spaceship. Quotes classic literature."], "falling down": ["Dilbert Goes Postal"], "bicentennial man ": ["One wants freedom. One wants to be human. One wants to die."], "snatch\n\ndye like dags": ["Dog steals jewelry. Chaos ensues."], "man of steel ": ["Who would win: Several highly trained soldiers in a plot to destroy the world OR One farmy boi?"], "the big short": ["A couple of guys make a bet but get really sad when they win."], "her": ["Couple breaks up because they can't fuck."], "high fidelity": ["A local business owner regales us with his past as he tries to get over a loss"], "little miss sunshine": ["Suicidal man travels across multiple states to join a child in stripping on stage"], "saw series": ["An old man abducts people and forces them to test out his deadly carnival rides"], "sahara": ["Check this one out alright?"], "the fifth element": ["A great evil approaches, only one man can save us, and he only has one point left on his licence"], "lucky number slevin": ["Two rival crime bosses look left while a dead horse goes right", "Two mob bosses threaten to kill a guy and everyone he loves, but it backfires on them because they brought in the wrong money-owing loser."], "evil dead 2": ["A man squats in a derelict building, amputates his hand, and kills all his friends"], "the mummy": ["Old man with a phobia of cats wants to destroy the world."], "the depahted": ["There's a rat with the bad guys and a rat with the good guys"], "john wick": ["Man seeks new type of therapy after dog is killed", "Man goes through an emotional and intense journey after the death of a loved pet.", "Ted is sad, so he gets dressed and murders everyone."], "monogatari i cheated": ["A teenager sexually harasses classmates, sibling, elders and young children alike until he is stabbed to death. He then sexually harasses a 11 year old girl who came to visit him in hell"], "a star is born\n\nx200b": ["She goes off the deep end, oh wait no he does"], "demolition man": ["Man says rude words because of 3 seashells"], "spy kids": ["Neo took the blue pill", "Machete's family friendly movie", "Brother and sister go on a quest to save their parents, held prisoners by a mad transmuter in his castle. Their evil body doubles do their best to stop them."], "star kid": ["A little kid finds a robotic suit that shits cheeseburgers into his face and helps him defeat alien invaders."], "spiderman": ["Thanksgiving movie where blood drips from the ceiling"], "goodfellas\n\nnow go get ya shine box": ["Christmas movie where a shoe shine boy murders his business associate."], "big trouble in little china ": ["Theres trouble brewing, and there's only one man who can save the day, and it's all in the reflexes"], "oh shit is this ghostbusters": ["Four dudes give a sailor a hot night on the town."], "the abyss\n\nyou bitch you never backed away from anything in your life now fight fight fiiiiiiiight": ["Man spends 3 minutes slapping a corpse"], "crocodile dundee": ["Country Hick takes a gorgeous blonde to meet the local wildlife, then goes on a trip to the big city"], "three musketeers": ["Country bumpkin goes to the big city, gets in lots of fights, falls in love with his landlords wife, asked to risk life and limb to protect an adulterer and ends up becoming a member of the guard."], "idiocracy": ["An average man becomes like a god"], "a few good men": ["One man seeks the truth, which he cannot grasp"], "shrek": ["The classic story of the princess and the frog, but reversed", "E", "Lonely man kidnaps a woman to get refugees to leave his property.", "The government orders to safe a woman and even though she is retrieved, she eventually gets corrupted into a monster permanently and lives with her new kind."], "gremlins": ["A Christmas movie about a species who are incredibly good at multiplication."], "a knights tale": ["A man can change is stars", "Underprivileged sports equipment manufacturer teams up with underdog athlete"], "star wars a new hope": ["A farmer is arrested by police, escapes from a station, goes back with his friends and blows it up."], "calendar girls ": ["You'd want to see them when they were younger but not when they're older"], "there will be blood": ["Bowling match goes horribly wrong. (Title finally pays off.)"], "eternally reposted sunshine of this spotless subreddit ": ["Couple beats advance technology by reliving their terrible relationship and getting back together"], "ex machina": ["Man treats a machine kindly, which ends up going poorly for all humans involved."], "my hero academia ": ["[Anime] The man failed at his one job, so he recruits a child to do it for him."], "tenacious d ": ["A pair of troubadours discover Bigfoot."], "toy story 3": ["Man with a woody leaves home"], "the big chill": ["One friend guilts another into sex after a funeral instead of just getting IVF or adopting like anyone else..."], "stardust crusaders": ["[TV-JP] A series of convoluted events has the protagonists travel half the world for a cure against a lethal \"ailment\" that kills in 50 days."], "9": ["Little machine wakes up. Accidentally wakes big bad machine. Big bad machine builds bad machines ultimately killing most of little machines friends. Little machine destroys big bad machine"], "bridge to terabithia or however thats spelled": ["A boy and his love interest have regular trips in the forest, after she dies he replaces her with his little sister."], "avatar the blue people one not the airbender one ": ["Man takes over dead brother’s life, leaves the country, and starts a war against the United States."], "finding nemo ": ["Main character with PTSD from witnessing his wife's murder joins forces with a woman with a mental disorder. They travel together to rescue his disabled son, who has been kidnapped.", "On his first day of school, a kid gets a plastic bag pulled over his head."], "the princess bride": ["A movie, based on a book, thats got a gentle giant, a suave man, two lovers and giant animals that don't exist"], "star wars revenge of the sith": ["Man goes on a murderous rampage because he wasn’t promoted"], "hot fuzz ": ["Local police murder town residents"], "narnia chronicles": ["Wardrobe Malfunction During World War II"], "pay it forward\n\nhhad no idea the child was the va for sora ": ["A wholesome story about Kevin Spacey shagging someone relating to a young boy."], "deep blue sea": ["A cook, a fish handler, and a doctor hunt an endangered species to make a LOT of sushi."], "or blazing saddles i havent seen it but ive heard a lot about it": ["Man becomes the law in a town where no one wants him, they start to change their mind when he saves them in an unorthodox way"], "naruto ": ["Kid is hated by everyone because his father did something to him that he shouldn't, but then uses the bad thing to get everyone to like him."], "monty python and the holy grail ": ["Man goes on a journey and on his way he encounters a man with severed limbs, talks with an over-the-top French man, and is arrested", "Some people are tasked to find a cup."], "the tuxedo ": ["Secret Asian man defeats a bad bug man with the help of a pain in the butt."], "closer": ["Four disastrously interconnected people fucking suck at relationships"], "mortal engines": ["A rebellious young protagonist joins a group of outlaws to destroy a deadly machine of mass destruction controlled by a shady father figure."], "cheers": ["[TV] Business owner woos his employee, then later, his boss."], "a star is born": ["Guy gets drunk a lot, marries the girl, kills himself because girl has become better than he was."], "dances with wolves ": ["Pretend native gets along with canine"], "indiana jones kingdom of the crystal skull": ["A crazy old man, an even crazier old man, and a young punk go on a quest for knowledge"], "the boy in the striped pajamas": ["A kid gets cooked because of his friend."], "stranger than fiction": ["A man tries to find the voice in his head before she kills him"], "victor frankenstein \n\nbodybuilding heh": ["Harry Potter and Professor Xavier join forces in bodybuilding."], "psycho": ["This guy? His mom thinks no woman is good enough for him"], "ratchet and clank ": ["[Game] Furry and a robot work together but not for the same end goal"], "black adder black adder\n\nhe rides a pitch black steed\n\nblack adder black adder\n\nhes very bad indeed\n\nblack his gloves of finest mole\n\nblack his codpiece made of metal\n\nhis horse is blacker than a vole\n\nhis pot is blacker than his kettle\n\nblack adder black adder with many a cunning plan\n\nblack adder black adder you horrid little man \n\n": ["[TV] 3 witches foretell a man he would be king. Later the witches realise they told the prophecy to the wrong man."], "silence of the lambs": ["An old hungry mentally challenged man gets help from a young woman to eat."], "shrek lol": ["Ugly Loner has a roommate who is a literal ass. Some fuckwad encourages him to get married"], "bohemian rhapsody ": ["Flamboyant dude becomes a singer."], "ok one more guess spider man into the spider verse": ["New York teen is taught by an emotional wreck how to be a superhero."], "now you see me": ["Group of people perform tricks for money"], "scooby doo": ["Some kids go to catch a bad guy."], "star wars ": ["A furry a farm boy and some friends topple a theocracy"], "thor ragnarok ": ["Man breaks his toy and goes on a journey with dysfunctional people"], "destination wedding ": ["John Wick goes to a wedding and surprisingly doesn’t kill anyone"], "predator": ["Child Molester hunts down Jungle Army Guys"], "daredevil": ["(TV show) Blindness and PTSD both fight against hair loss."], "benjamin button": ["Forrest Gump, but backwards."], "battle royale": ["In this film the number 42 isn’t the meaning of life - it’s more like an inventory of bloody horrible ways to die"], "bolt": ["Afraid of Styrofoam packing peanuts, journeys across america with a fan and a pessimist and ends up in Hollywood. (And theres also a fire)"], "bruce almighty": ["Life sucks, lost job and wife-to-be, blasphemy gets him places."], "paranorman": ["A boy can see dead people...and it effects an entire new england town"], "coming to america": ["A royal from an unknown African country comes to America and causes a fuss."], "poseidon": ["This cruise is flippin’ amazing!"], "monster house": ["Angry old guy dies, pubescent neighbor discovers many shocking things about him and his house and turns out he wasn't dead."], "miss peregrines home for peculiar children": ["A group of people have to relive a Nazi raid daily."], "next": ["Man has sex with a chick from a diner he's been stalking and has a dream about stopping terrorists afterward."], "kingsman the secret service": ["Guy quits the army and becomes a tailor"], "zootopia": ["A furry animal breaks stereotypes and solves a mystery, makes an unlikely friend and almost gets killed by animal Marlon Brando.", "Woman reinforces racism with drugs to get elected"], "hancock": ["Some asshole saves some people, goes to jail, finds his long lost sister he forgot he had, and saves some people and kills others horrifically."], "despicable me\n\nformerly lehman brothers": ["A very tall man asks for a loan multiple times from the bank for a very ambitious space exploration project, but is refused every time"], "pirates of the caribean": ["Drunk guy with a lot of jewelry tries to get his boat back"], "a day with wilbur robinson": ["Mike Teavee meets a Dr. Seuss family, the american version of the insulting french guy from monty python, and evil clothing items."], "harry potter and the goblet of fire": ["A special boy with glasses and the one where no one got a freaking haircut."], "20000 leagues under the sea": ["A mysterious thing stalks the oceans. A shady man is behind it. And some french guy and Peter Lorre find it."], "shrek\n": ["Young woman wins the “I woke up like this challenge” but her ugliness eventually reveals itself, to surprise of her suitors, in this fantasy about body positivity"], "ant man and the wasp": ["Dad with shiny ankle bracelet tries tricking cops and helping people that hate him."], "bird box": ["People are scared of a monster, but not when indoors, because the the monster doesn't know how door knobs work."], "red riding hood or wer": ["Girl has sex with werewolf and some other weird stuff happens"], "saw\n\nx200b": ["2 guys get stuck in a bathroom"], "pikmin ": ["(Game) alien enslaves an entire race of creatures to pay off his bosses debt"], "yugioh ": ["Kid plays a card game, but it goes from 0 to 100 real fast"], "lucifer": ["(TV Show) Guy solves crimes by asking everyone the same question."], "into the woods": ["Man follows girl through a forest, another man chases after a lady to have as his own and a third man finds another lady trapped in a forrest"], "the double": ["Jesse Eisenberg kills himself after his coworker sleeps with an underage girl"], "bloodborne ": ["[Game] Random foreign person goes on the worlds bloodiest errand."], "jumanji": ["A man takes 27 years to finish a board game."], "black mirror bandersnatch": ["When something goes wrong, we get to play the Will Smith Youtube Rewind intro."], "wrinkle in time": ["A father who gets lost lightyears away gets found by his daughter - who was helped by Oprah."], "field of dreams": ["JD Salinger is black and surrounded by ghosts."], "clerks": ["A man goes where he isn’t supposed to be, contends with savages, does not get shot.", "that movie with that dude who was in that one that was out last year"], "step brothers": ["Two guys are forced to live together begrudgingly. Both suck at life and being anything but lazy humans. Trial, error, and multiple failures leads them to unite and go into business together, turning their hopeless lives around."], "empire strikes back ": ["Big furry creature poorly fixes shiny guy"], "citizen cain": ["Some old guy dies because he can't find his sled."], "the iron giant": ["Big metal man has to choose where his loyalties lie and compares himself to a fictional super hero"], "doctor who": ["[TV] Death isn't a major concern for this guy, for he has twice the horsepower of a normal human, and time hopping abilities."], "the room": ["A successful Everyman is betrayed by his best friend and his fiance. He gets a handgun and vows to finish things....", "Man did not hit someone"], "harvey": ["A man is ridiculed and tried to be institutionalised for having a friend"], "star trek voyager": ["[TV] People on a spaceship die when it gets lost."], "into the spiderverse ": ["Desperate middle aged guy and his apprentice fight a traumatized bald man"], "innerspace": ["man at mall unexpectedly finds navy pilot inside him; kisses pilot's fiance, twice; ultimately follows them on their honeymoon."], "johnny got his gun": ["A Suicidal war vet is trapped in a hospital"], "dragonball ": ["[TV series] Alien falls on earth and learns ergokinesis and saves planets, if not, the universe, with his useless friends"], "its probably too obvious but  aquaman": ["Ocean man! Take me by the hand, don't go to war with land! Try to understand!"], "an xmen movie ": ["A disabled man gets a homeless man to attack an attractive man."], "dont breathe": ["Some thieves trying to make bank find a sperm bank instead", "A man doesn't see that he's actually fighting some teenagers."], "solve what\n\nproblems with portals ": ["[Game] A psychopath who’s been living for hundreds of years forces you to solve."], "spykids 3d": ["Kid enters video game world gets high score, battle continues into real world"], "iron man 3": ["Guy gets cured of a disability and kidnaps the president", "A billionaire harasses a mentally ill man."], "black mirror": ["Man fucks a pig for justice"], "the shining": ["Crazy husband goes crazy and chases his son through a maze."], "drag me to hell": ["An old woman vomits down a young woman's throat for 100 minutes."], "mr bean ": ["[TV Show] In one episode, the guy headbutts the Queen after whipping out his penis."], "are we there yet\n\nx200b": ["A man tries to get get with a woman by taking her rambunctious children across the country."], "halloween": ["A young man will do whatever he has to to be reunited with a long-lost family member on a very special holiday."], "lord of the flies": ["British boys fuck a pig and practically burn down a deserted island"], "man on the moon": ["A comedian pranked his way into comedy history pissing people off along the way"], "beauty  the beast": ["A girl dreams of adventure and then proceeds to marry a furry"], "the island ": ["Man discovers that people only live until they go on holiday"], "hereditary": ["A young man is forced to take his underage sister to a party and she gets smashed when he’s not looking. After his parents find out, his dad gets all fired up."], "assassins creed odyssey": ["[Game] Kid grows up and starts sailing and jumping off mountains"], "beavis and butthead": ["Two young gentlemen accidentally travel across the USA in pursuit of their stolen television. They eventually recover the television, but don't have sex with anyone."], "back to future": ["Some kid has to pretend to bang his mom in order to live."], "stardew valley": ["[Video Game] Rather than using taxpayer's money, communal motions or laws, or any other forms of politics in his power, the mayor of a small town forces a newcomer to fix the decrepit community center."], "john q": ["Guy doesn't want to bury his son he wants his son to bury him"], "avengers infinity war": ["Single father abuses his children, and then most of the universe"], "the dish": ["Three men in a sheep paddock are key parts of one of the greatest moments in human history"], "billy elliot ": ["A disobedient boy refuses to make his dad proud and dances to rub it in."], "office space\n\nsuperman iii\n\nhackers\n\nall use the salamislicing scam as a plot point": ["guy gets really rich slicing a lot of salami."], "battleship potemkin": ["Sailors go political because they have to eat bugs."], "i fucking love this movie \n\nits the pacifier no": ["Triple X spying on a nazi in training only to find out it was just an act."], "deadpool ": ["A woman loses her boyfriend when he gets cancer."], "animal crossing": ["(Game) the mayor is a prisoner"], "the big year": ["Some birds fly and two hardcore nerds fight to see who can see the birds fly the best."], "rango": ["Mentally deranged pathological liar ultimately saves a town from drought with a kiss"], "solo": ["Poor kid turned smuggler learns the value of doing things first", "Vision meets Haymitch in space."], "hardcore henry": ["You see the world from a guys perspective as he kills a bunch of people to save his wife"], "overboard with goldie hawn and kurt russel": ["An outsider learns about life and love from noble savages, and fights along side them to protect their dreams and future, proving they are now family. There's water or something."], "portal": ["[GAME] You're just trying to beat the computer, and you solve all your problems with your gun."], "little mermaid": ["A young immigrant's life is nearly ruined by a man's respect for unambiguous affirmative consent"], "the martian": ["Everyone regrets forgetting a famous pirate."], "enders game": ["Depressed soldier uses relativity to commit genocide."], "alien  ": ["Truckers discover a new species of cockroach."], "million dollar baby": ["Woman loses a fight to a seat"], "donnie darko": ["Misunderstood and angsty teenager is chosen to die, but lives, and then decides to save the world and dies happy.", "Teenager saves the universe with the help of his sister's boyfriend in a Halloween costume"], "doom": ["A film based on a game, about a guy in space, with guns facing... People?"], "memento": ["Shit sneppaH"], "signs": ["A dying woman foresees how to protect her family from demons."], "hard candy ": ["Modern day little red riding hood stalks the wolf"], "ateam": ["Men, which shoot out of a tank, that's hanging on am parachute!"], "pokémon 4ever": ["A grandpa gets sent back in time and has to rescue a onion fairy with help from his grandsons rival"], "dragon ball": ["Immigrant decides to get a hold of a dude's balls who surprisingly isn't Asian"], "van helsing": ["Wolverine travels to East-Europe and meets an old dude, an ugly dude and a big dog"], "is it life after beth": ["A young woman is dying to go on a hike with her boyfriend"], "snowpiercer ": ["People take a train journey because it was free, ends up in chaos and their holiday is ruined when the train derails"], "osmosis jones": ["Cop gets robot looking partner and solve the biggest crime in their world"], "the incredibles\n\nx200b": ["Woman suspects her husband is cheating on her"], "walle\n\nx200b": ["A square with treads and a space egg search for greenery among fat people in tights."], "wonder woman": ["Ancient weapons and the power of love help end World War I"], "g force ": ["Household pets and pests team up against their human overlords."], "the dark knight ": ["A billionaire harasses a mentally challenged man"], "big hero 6": ["After his older brother gets fired by his boss, our main character teams up with his nurse to beat up his brother's former boss.", "Kid starts going through puberty after his brothers death"], "guardians of the galaxy ": ["Boy kidnapped by cannibals, runs away, and in the end picks up a rock"], "the phantom menace ": ["Monks save pilot from horny redhead."], "willy wonka and the chocolate factory": ["A crazy man invites a bunch of underage children over and tortures them"], "percy jackson  the lightning thief": ["An uncle is pissed when he accuses his nephew of stealing his thunder. A bunch of teenagers almost die trying to calm him down."], "lego batman movie": ["A plastic superhero discovers the importance of family."], "kingsman": ["A kid gets recruited into a secret group, then is asked to shoot a dog"], "transformers": ["Boy's car gets him a girlfriend, new government friends, and new car friends to then almost get him killed within the next 6 months."], "avengers age of ultron": ["Eastern Europe siblings discover that Americans are good and then help them ruin their home town", "The heroes win in the opening scene, so they create a villain for the rest of the movie"], "the emperors new groove": ["A fussy ruler goes on a journy with a meme to rescue his kingdom from a mad scientist and the principle from kim possible."], "avatar the last airbender\n\ndunno but it kinda fits": ["Boy chases old man for his abusive father's approval."], "frozen": ["Young woman troubled by her sister's distant behaviour and her own delusions goes on a trek."], "baby driver": ["Private taxi driver attempts to pay off an old debt"], "im sure its a stretch but im going to go ahead and say the spongebob movie": ["Young Fast Food worker must interfere in national politics to stop a small man from making money through a scheme that also involves national politics"], "skyrim": ["(Video game) Man yells at things"], "catch me if you can": ["Man has a lot of work experience with professional jobs throughout his young adult life, he goes to jail and gains freedom using the skills he has gained through film"], "star wars a new hope\n\nduh": ["Man reunites with his son briefly before 19 years of work is blown up by him"], "legend of zelda breath of the wild": ["[Video Game] A knight dies and the people decide to throw him into a tanning bed for long time."], "greys anatomy ": ["[Series] pretty much everyone dies or almost dies"], "pokémon the first movie": ["A genetic creation tries to kill a bunch of kids pets an getas defeated by tears"], "aint that golbin slayer": ["An armoured guy REALLY hates a specific race, and kills every one of them he sees. He then parties with an underage girl"], "into the spiderverse\n\nbtw i love your explanation": ["Highly intelligent freshman becomes a criminal after another criminal gets killed and beats up a father who just wants to see his family again"], "doctor who ": ["An old man travels through time picking up chicks."], "its the spongebob squarepants movie": ["Two buddys embark on a long journey because of some jewelry. They ride on someone's back at some point. In the end, they manage to defeat the ultimate bad guy and his army, but no buildings are destroyed - instead, they perform an epic musical number!"], "harry potter and the prisoner of azkaban": ["Godfather breaks out of high security prison and goes looking for a friend he used to commit crimes with."], "snow white too easy": ["Seven men who let a woman stay in their house watch a stranger kiss her in her sleep"], "beetlejuice ": ["Couple dies and asks for a lunatics help"], "one flew over the cuckoos nest ": ["A red indian throws a sink because he liked a sane man"], "the neverending story": ["A boy's horse drowns so he decides to ride a dog. Later, a different boy rides the dog."], "beauty and the beast too easy": ["Hairy guy kidnaps a girl's dad so that she will fall in live with him"], "gordy": ["talking piglet, who heads off to search for missing family once they're shipped off to a slaughterhouse"], "justice league doomsday": ["Illegal Immigrant teams up with a pilot, a Greecian citizen, a jogger, a detective and a hacker to defeat a stoned man."], "big hero 8": ["A robot gets drunk as fuck on low battery."], "smash ultimate": ["[Game] Crocodile pirate king beats up gender fluid magician on a race track"], "titans": ["[Series] Detective kidnaps teenager to find who killed his parents"], "splatoon": ["You shoot your goo over children and you're never the bad guy."], "harry potter and the chamber of secrets": ["A schoolkid kills the pet of his friend's sister after it stared at his other friend."], "harry potter": ["a fully grown man repeatedly fails to use his stick on a kid.", "A fine young man's life is turned upside-down when a horrible, insane relative comes to stay with his family, threatening to ruin their lives. The family is forced to go on the run, until finally they're saved when the relative is dragged off by someone even more insane than he is."], "spongebob movie": ["Two mentally disabled friends go on an adventure to steal a big hat from a thrift store"], "persona 5": ["[Video Game] A gang of teens and a talking cat make mean grown-ups cry"], "schindlers list ": ["A man decieves a his nations government in a bid to stop them from confiscating his child labourers"], "iron man 2": ["A billionaire get harassed by a mentally challenged man.", "Man kicks off because he lost his bird"], "blade runner2049": ["A man and his waifu try to find life-u"], "captain america": ["Toothpick wannabe jacks up on steroids and does community service"], "the pick of destiny my man": ["Two amateur musicians search for an ancient relic in order to pay their rent"], "the hunger games ": ["Lady Hawkeye fights to please rich people"], "the watch": ["Guys get drunk with an alien corpse and have to blow up a shop"], "pirates of the caribbean the good one ": ["Sheltered young woman lies about her identity and ends up on a cruise with a bunch of promiscuous strangers."], "a series of unfortunate events": ["3 kids are very unlucky"], "spongebob squarepants": ["[TV Show] Join an aspiring cook and his mentally challenged comrade as they struggle to adapt to a post-nuclear holocaust way of life."], "cars": ["Asshole athlete gets lost and learns how to not be an asshole.", "Famous Racer develops Stockholm Syndrome"], "men in black": ["Guy gets hired because he was a good runner."], "the book theif": ["Death tells a story about a girl who steals from racists and hides a minority in her basement."], " neon genesis evangelion": ["[Japanimation] Everyone has daddy issues, mommy issues, or both. And that's not even the weirdest part. Fans always recommend it tho."], "magic the gathering": ["[Game] about the only time you'll see dinosaurs, vampires, pirates and merfolk fight"], "pirates of the caribbean 2 and 3 the ones with davy jones": ["A man whose heart is in the wrong place has some remorse about his lost love. Thankfully he is reunited with her in the end."], "oh no its the emoji movie": ["Misfit from a mediocre and conformist society find other misfits and saves his world from elimination."], "mr beans holiday  ": ["Man kidnaps a kid, steals a bike, drives a car (most probably) uninsured and drives a man to suicide"], "mars attacks": ["Music, however bad it is, solves everything."], "herbie goes to monte carlo": ["Two criminals insert a stone into the innards of the protagonist who is competing in a race"], "doc hollywood": ["Basically the movie Cars but with people and no racing."], "once upon a deadpool  ": ["Man is in bed when a cool guy forces him to listen to a story about his life"], "night at the museum": ["A newcomer gets trapped with a bunch of very important but crazy people"], "the ring": ["A woman makes copies of a video of an underage girl and shows it to people."], "beauty and the beast": ["Girl and guy have a really long sleepover. Guy has a MASSIVE makeover at one point due to her being there."], "the scarlet letter ": ["A woman’s life is changed when she receives a nasty letter"], "ai ": ["Robot Pinocchio abandoned by Mother after tryin to harm Human brother by mistake."], "tau": ["Girl gets kidnapped and has to make friends with the kidnapper's high tech google home to escape"], "bad lieutenant": ["Guy with nasty drug habit tries to fuck lizards."], "tom and jerry": ["[Show] A boy constantly defends his home from a troublemaker living in his walls."], "your name": ["Teen hallucinates about his dead \"girlfriend\" after drinking too much alcohol in a cave.", "Girl dies when her town gets destroyed by a meteor. A guy travels back in time to warn her, then she survives and they live happily ever after."], "three men and a baby": ["An odd family dynamic where none of the adults have sex, but there's a child"], "under the rainbow": ["Midgets get mixed up in international spy transaction after pearls are dropped in the liver ."], "interstellar": ["Widowed engineer verbally jousts with a sarcastic marine while his grandson dies."], "hamilton": ["[Theater] Politician royally fucks up his family and career, betrays his friend and gets himself killed."], "underworld the 4th part ": ["Near the end of a war, a woman wakes from a coma to find out she has a daughter that needs protected from some hairy men"], "the black cauldron\n\nedit a word": ["Boy dreams of becoming a hero, proceeds to get emotional towards a cooking pot"], "the king and the mockingbird ": ["Two paintings fall in love and the authorities are not amused"], "the postman": ["Con man posing as USPS employee overthrows government by reciting Shakespeare."], "constantine ": ["Guy saves the world via suicide."], "venom": ["After a failed engagement, a man ends up in the clingiest rebound relationship ever."], "bird box ": ["Single mother takes her kids for a boat ride."], "technically star wars episode 3\n\ndid you ever hear the tragedy of darth plagueis the wise": ["Man kills his teacher so resolves to commit genocide."], "angels and demons ": ["[Adaptation] Professor of a non-existant branch winds up in a race against time to defuse, what is effectively, a nuke."], "freaked": ["Bill and Eddie make friends in South America, but Eddie tries to make Bill kill his friends, so Bill kills Eddie... twice. The worm missed out on macaroons."], "the santa clause 2": ["I have to get married in a month and my son is a piece of shit"], "skyscraper": ["A pearl with a rock inside gets set ablaze"], "district 9": ["Racist slowly becomes what he hates."], "redline": ["Young man loses race but advances to the next one anyway. He then survives a nuclear blast. Also, there is Mafia."], "one of the star trek movies not the reboot with the original cast members \n\nedit star trek iv the voyage home": ["A small team in a stolen vehicle travels to California to steal some specimen from a zoo."], "stand by me": ["Kids walk for a day, then shoot a gun"], "300": ["Some dudes guard a hallway while their town has fun with a festival."], "kung pow enter the fist": ["A guy murders a family but fails to kill the baby. The baby grows up and kills the guy after the murderer changes his name."], "hellraiser": ["Guy opens a box, has a hell of a night with a couple of tough customers. Afterwards, it takes him years to fully regain his energy but his family pulls him through."], "raiders of the lost ark": ["Archeologist defeats the Nazis by doing the Bird Box Challenge", "God slaughters a group of German archaeologists."], "kingpin": ["Professional athlete comes out of retirement in poor fashion. Doesn’t culminate in a run-around, but anyway..."], "the goonies": ["Boy rescues disabled man from abusive family while a girl learns that a classical education has value."], "star trek the 2009 reboot": ["Bald Man Punishes Man for a Crime He Hasn't Committed...yet"], "super mario": ["[Game] You spend all of the time breaking stuff on weird drugs, and killing people to stop some thot from making food to some guy"], "waitit is the incredibles": ["Activist uses tech to protest; gets arrested to a fantastic jazz soundtrack."], "was thinking karate kid but he was harassed not harrasing ": ["A war vet teaches an angry teen to finally beat up the people he has been harassing unsuccessfully."], "the martian ": ["Potato famine in space."], "the sandlot": ["Colleagues assist in conquering a beast to reacquire family heirloom"], "the fundamentals of caring": ["A middle aged man takes a kid across the US to pee into a quarry"], "seven ": ["Guy gets extremely upset over a package he did not order"], "akira": ["Two dudes yelling each other's names a lot."], "some like it hot": ["Friends decide can either become traps or die. They choose the former."], "lord of the rings ": ["Story of a descendants journey to clean up his ancesters mess", "Group of unlikely friends go on a journey, whilst camping one is killed by some creepy old dudes new employee"], "gladiator": ["Wheat farmer vexes salad-man. Epic entertainment ensues!"], "ready player one ": ["A boy saves a world by playing video games wrong"], "home alone 2 when he gives kevin directions ": ["Donald trump is a human being for 3 seconds"], "hot tub time machine": ["Guys get wet and realize the 80’s weren’t really the best."], "lazer team edit its a little too obvious": ["Four idiots steal a set of armor and have to take part in a gladiator fight"], "the revenant": ["Guy sleeps, crawls, walks for most of the movie to get revenge on a guy killed his family."], "enter the dragon": ["Young Asian man goes to island to avenge their siblings (which wouldn’t have happened if it wasn’t for this old Asian man who owns said island)"], "bridge to teribethia damn you i didnt want to cry today ": ["Invite your friends to art museums overwise they drown"], "the pixar animation ": ["Murderous light bulb on a stand is caught in the act."], "to kill a mocking bird ": ["[Book Adaptation] It does NOT teach you how to kill flying animals."], "spiderman its the first one that came to mind": ["High school student fights an old man"], "captain america civil war ": ["An argument leads to a breakup at an airport, then they almost reconcile later, but break up harder."], "up": ["Old man kidnaps a child and goes to South America"], "slenderman": ["[Game] You get random drawings while you walk through a forest with someone you know by your side"], "venom ": ["Man with personality disorder can’t stop eating"], "that thing you do": ["Substitute in a band accidentally gets them famous"], "rascal does not dream of bunnygirl senpai": ["Guy dates an invisible \"rabbit\""], "disney pixars cars": ["Guy tied a race by tonguing"], "the binding of isaac": ["Cry on your mum to kill her"], "armageddon": ["Fossil fuel company employees travel to a very remote dig site for a few days, some of them come home"], "who killed captain alex": ["No one knows who killed Alex."], "mulan ": ["Country that isn't keen on girlpower is saved by girlpower"], "kingsmen": ["A wealthy businesswoman lobbies to legalise her trade, but secret combat tailors stop her along with some whisky guys. Also, President ousted after believing drugs are bad."], "indiana jones and the kingdom of the crystal skull": ["Washed-up franchise hides in a household appliance."], "house\n": ["[TV Show] Handicapped drug addict saves people with his team"], "armageddon ": ["A man goes into space to save the world, but he doesn’t save the world."], "the interview": ["TV people perform a political assassination."], "yugioh": ["[Anime] Teenagers get hurt by light while battling with monsters"], "the woman in black": ["Guy helps woman find her son and kills him with a train in return."], "meet the robinsons": ["Baseball player, turns to evil after being sleep deprived"], "primer": ["Two clever guys discover a thing...and...okay I was with them until...and now I'm totally lost."], "chasing amy": ["A woman is cured of lesbianism with good dick and skee ball."], "elf": ["A child kidnapped at birth flown north later tries to find his dad in America."], "mowgli": ["A boy doesn't like being human, and nobody wants to sing."], "lucy": ["The chick injests super soldier formula. Gets emotional range of Winter Soldier. Gets powers of Scarlett witch, jean grey and Charles Xavier. Ultimately turns into jarvis."], "minute men": ["High school students end up on FBI's Most Wanted by helping classmates not get embarrassed."], "rock a doodle": ["Kid becomes a furry to save an Elvis rip-off."], "lilo and stitch ": ["Lonely girl buys friend."], "death bed the bed that eatshttpsmimdbcomtitlett0385639 ": ["Girl gets in bed with a guy, gets eaten."], "puss in boots ": ["Man teams up with with the man who framed him for robbery for one last heist."], "i swear if this is the 3rd fred movie": ["Mentally ill child is forced to attend summer camp, competes against a rival camp."], "the lion king\n": ["So this guy kills his dad, runs away from home to live with his stoner friends but eventually reconciles with his family but not before also killing his uncle"], "series of unfortunate events ": ["Some dude adopts kids, follows them and tries to kill some adults."], "i dont remeber the name but there was a disney channel movie about a guy who dressed as a chicken to be his school mascot and gain confidence\n\n am i close ": ["Introvert becomes an extrovert, but only when he wears a fursuit."], "good burger": ["Rival fast food chain wants to steal me secret formular."], "looper": ["Man kills himself after he prevented killing himself in his future."], "flushed away": ["Evicted rich kid slums it up with some street rats"], "twitches": ["Black magic saves magical kingdom from spooky cloud"], "split": ["A man with a huge personality saves a girl from her rapist uncle"], "cow belles ": ["Spoiled rich girls save the day after someone milks their dad's company for all it's worth."], "luck of the irish": ["After losing an heirloom, a teenage boy's body goes through changes."], "american beauty": ["That paedophile gets blazed, bulks up and gives it to the US army right in the kisser..."], "percy jackson and the lightning thief": ["A teenage boy struggles with figuring out his past, and struggling with the job of his high and mighty dad. That is, until his dad's friends crap gets taken."], "if hunchback of notre dame had a crappy straighttodvd sequel that forgot everything that made the original so amazing would that be the answer ": ["Circus man wants to steal implausible bell"], "the fox and the hound ": ["Two neighbors are friends, then decide they can't be, then they are anyway."], "manchester by the sea": ["A boy cries because of the freezer, a man cries because of the fire"], "a fish named wanda": ["Lawyer decides to have an affair and runs off with his client’s stolen property."], "green lantern": ["Man finds a ship and a man inside the ship and and goes to distant lands, eventually goes back home and finds home under attack"], "its like describing infinity war as single father ends world hunger with his rock collection\n\nits true but its a bad way of explaining it": ["I’m Genuinely Confused, Hoping Someone Can Explain..."], "synecdoche new york": ["Successful loser continues getting more lost in reality and his fear of losing control in a russian doll like world he's created for himself."], "hanna": ["The Bourne identity if Jason Bourne was a 12 year old girl"], "captain america civil war\nor spiderman homecoming ": ["Billionaire practices his parenting skills with a kid that he saw on YouTube"], "election": ["School teacher holds a grudge against a student, and rigs an election to get back at her."], "the hobbit again": ["A group of homeless guys organises a party at a strangers house and convinces him to become a thief."], "eternal sunshine of the spotless mind": ["Brain-damaged couple go to the beach in winter"], "oldboy": ["All about an incestuous relationship with no French kissing"], "chicken run": ["A cocky American ex-con terrorizes two farmers"], "shrek 2": ["Newlyweds visit the bride's parents, her father disapproves of her new husband and is coerced into making her marry another man"], "the matrix\n\nthis is probably way wrong since i havent seen that movie in a whilei know they mostly use guns but neo knows some forms of martial artsright": ["A lonely nerd finds his place in the world when a wise elder helps him learn martial arts and spiritual growth, he finds love and beats his nemesis in a climactic fight"], "airplane": ["A group of passengers are going to die unless one man can save them all, also there is one doctor called shirley"], "ah cells at work": ["[Anime]: A courier and a soldier frequently encounter each other in a semi-communist society."], "harry brown": ["Old man tries to clean up his neighbourhood after his friend is killed"], "flash gordon": ["The earth is being destroyed, only one man can save us now, and he only has 14 hours to do it"], "rick and morty ": ["Tv series: old man with a drinking problem mentally abuses his idiotic grandson, while his daughter and dimwitted son-in-law try to fix their broken marriage"], "despicable me ": ["A single dad is actually the good guy of the story even though he's a villain. He also messes with a moon."], "wargames": ["One man makes the mistake of not playing chess"], "tucker  dale vs evil": ["Guy renovates a house with a friend, meets a girl, visits a lumber mill, invites a guy to have some chamomille tea"], "war of the worlds": ["A bunch of badass aliens fight earth then just die in the last three minutes."], "blast from the past": ["A family trapped underground sends their child to get supplies and falls in love"], "scream": ["A film buff gets angry about his parents’ divorce."], "paycheck maybe ": ["Actually need help figuring out what this movie is."], "the terminal": ["A man gets stranded on an island and is unable to make it back home, eventually he gets home"], "the faculty": ["Aliens first take over the school, and then the entire town."], "an american tail": ["A jewish family is separated while fleeing genocide. They spend the entire rest of the movie being ridiculously close to reuniting."], "saw": ["Cancer patient spends his last days trying to help other people"], "grave of the fireflies": ["City burnt. Parents dead. Brother and sister starve"], "deadpool assuming you meant receiving cancer treatment": ["A man with cancer has a life changing moment while receiving cancer and decides to dedicate his life to one thing"], "waking ned devine": ["A village becomes rich after two elderly people die."], "avatar ": ["Pocahontas but blue"], "jumanji welcome to the jungle": ["Group of 4 get stranded in a jungle and attempt to survive and escape"], "boku no hero academia": ["[manga/anime] eating hair leads to powers"], "jojo part 8": ["[Manga/anime] Guy has 4 balls because a guy fell of his carriage"], "death of stalin": ["Bunch of Russians Don't Know What To Do When Their Boss Dies"], "the punisher ": ["[TV Show] A Castle is Hated by The Criminal Underworld Because They Get Punished by It"], "downsizing ": ["A couple choose to lose weight, the woman changes her mind and files for divorce, man has a mid-life crisis and begins helping refugees."], "dexter": ["[TV Show] Mentally ill scientist kills people because he's good at it"], "cats dont dance": ["Some pussies and other wild animals want to be popular but they are neglected by some racist baby"], "the narnia series": ["Christian propaganda disguised as a fantasy movie"], "dragon ball  ": ["[Manga/Anime] Daughter of renowned inventor goes on a journey, meets gullible boy, perverted old man, several talking animals and a megalomaniac imp."], "this is my go to answer a lot and im always wrong but im feeling lucky tonight\n\nkill bill ": ["Recent coma patient spends 4 hours trying to kill someone"], "the land before time": ["A mass exodus through a desolate wasteland to find a promised land. A boy encounters prejudice witnesses death."], "the departed": ["Leonardo DiCaprio cucks a man while working to destroy his livelihood"]}