{"Apocalypse Now": ["They get out of the boat."], "Taken": ["They don't let his daughter go, so he looks for them, he finds them, and he kills them."], "Predator": ["That predator nigga thinks he's choppin hard, but he's hardly choppin."], "Marley and Me ": ["In this heartwarming tale Jennifer Anniston has crazy sloppy sex with the milkman, blames broken vase on the poor dog. Then she rapes dog to death. I cry every time."], "The Notebook": ["Guy meets girl and says romantic crap to her on boats and fairground rides. Viewer sees opportunity to watch faggy films like this with a girl and cop a feel of his girlfriend's tits for a couple of hours. One of the faggy actors dies but who gives a shit, by this point you should be fucking anyway. Credits."], "Where the Red Fern Grows": ["Like Old Yeller, but with twice as many dead dogs."], "Love and Other Drugs": ["Boy meets girl, girl has debilitating neuropathic disorder, boy falls in love with girl, girl is a cold shell to avoid getting hurt, insert banging for the next hour, fight, chase her down, kiss and make up."], "2 girls one cup": ["A complex exploration of gender roles in a post-structuralist/gender-abstract context."], "Cube": ["People wake up in a maze of trap filled cubes. Everyone dies except the retard."], "In Bruges": ["Shot entirely in the same 7 block radius of a complete shithole. Everyone dies, even the midget."], "Animal House": ["My college experience in a sorority being around fraternities. All stereotypes are true."], "Lolita": ["Boy falls for girl, girl dies, boy turns into ephebophile professor, professor orchestrates sordid chain of events leading to girls death, you are left with a looming sense of guilt that you want your first love back just as much. And then some balloons and a clown. (Director's cut only.)"], "Labyrinth": ["Dance magic, dance"], "Avatar": ["dances with wolves except aliens"], "The Hobbit": ["The guy with the permanently confused expression from The Office (UK) is small next to Ian McKellin looking like he's about to die, and they run around a bit until they meet this creature who screeches a lot. Your gin runs out and you fall asleep. End."], "The Blade Trilogy": ["One:", "Black vampire kills an underground klan of white vampires. I'll be honest it was pretty damn racist.", "", "", "Two:", "Black vampire destroys blood banks for white vampires. They even turned Hellboy white and made him a skinhead. Shit gets even more racist. Blade also hugs a naked old man which sets a gay undertone to the entire movie.", "", "", "Three:", "Black vampire kills Dracula. Yeah, like that would ever happen. Surprise, surprise... Dracula, the supreme vampire is white. Extremely racist. Also, the old white guy dies so Blade never gets to fuck him. I was literally left with my dick in my hands and no gay vampire sex to watch."], "Lie With Me": ["You spend an hour and half wondering how a film can be this shit and then the credits pop up \"Made in association with Telefilm Canada\" and it all becomes clear."], "The Day After Tomorrow": ["Shit Freezes, but don't worry it wont happen until 48 hours from now."], "The Running Man": ["Arnold gets framed. Prison workyard. Slave collars that explode heads. Escape scene. Cigars and biceps. Cute mexican gets tied up in gym equipment. Arny gets arrested again. RUNNING MAN! WHO LOVES YOU AND WHO DO YOU LOVE! Crazy rocket rollercoaster car. Running through slums. OddJob from Bond has a razor hockey stick, but gets got. Dynamo and Chainsaw Charlie attack, and get got. Jesse Ventura is Captain America somehow. The game is a lie. Black guy with flamethrower. Arnie's innocence is proven."], "Top Gun": ["Tom Cruise is emotional enough to make Kelly McGillis love him and a bad-ass pilot enough to make Val Kilmer love him. They play volleyball and blow up communists. Tom Cruise converts Tom Skerritt to Scientology. (Director's cut.)"], "Blade Runner": ["An alcoholic android hunter shoots the shit out of stripper that molests an andoird snake then falls in love with a girl that is unaware she's an android (but he is). Its his job to kill androids way to not do your fucking job asshole. In the end the evil android leader saves Han Solo then dies of natural causes while crying and his pet dove flies away."], "Deep Blue Sea": ["Scientists make super-intelligent sharks. Sharks get angry. Sharks attack Aquatica (the underwater research facility that can be destroyed by a fucking shark). One nigger gets eaten by a shark, another nigger blows up a shark with a zippo and a gas oven because the shark ate his pet bird (you're a fucking bird... learn to fly). Long story short, LL Cool J teaches us how to make the perfect omelette, stabs a shark in the eye with a cross, shoots a white guy with a spear gun then blows up another shark, the end."], "The Heist": ["Hi, I'm Gene Hackman and PLOT TWIST LOLZ YOU GUYS DIDNT SEE THAT COMING HOLY SHIT HERES ANOTHER ONE WHAT THE FUCK IS DANNY DEVITO YELLING ABOUT"], "The Marine.....series.": ["The first one.", "Part Two", "And Three...."], "Ghost Rider": ["Gay. Credits."], "The Thing (1982)": ["Swedish", "Norwegian scientists dig up some thing from outer space. An American liquor and drugs party goes wrong when a dog shows up. Paranoia. Flamethrowers. Everybody dies."], "Dreamcatcher": ["3 guys fall in love with a retard. Retard dies. 3 guys go to cabin. They take care of stranger who bleeds out his ass. Ass blood turns into an alien. Turns out the retard was an alien all along. Retard alien kills Evil ass-blood alien who took on the shape of a ginger. Also a guys finger get blown off with a hand gun."], "Serenity": ["Brilliance is never rewarded."], "Madea Goes to Camp": ["I'm basically a black Ernest LOLOLOLOL"], "JFK": ["EVERYONE KILLED KENNEDY!!!!!!"], "The Bourne Legacy": ["Jeremy Renner has two different pills.  He loses one of them.  Some woman tells him he didn't need the pill anyway.  Edward Norton wants to find him.  The end."], "Goon": ["A mildly retarded juicer gets paid to be the pro wrestling equivalent of a hockey player. Sadly, no one dies."], "Oldboy": ["Guy gets drunk, wakes up in a hotel room. Eats shitty food, and occupies himself by jacking off and beating walls up. Gets out, beats <Gary Oldman>EVERYONE</Gary Oldman>  trying to find out who imprisoned him. Dramatic standoff. INCEST. DOUBLE INCEST."], "28 Days Later": ["A bunch of PETA idiots attempt to release a bunch of monkeys infected with PMS. The monkeys go ape shit and kill the hippie retards and unleash the fury of PMS on the United Kingdom. People get burned alive, a child has his head beat in and the all the women are given free valium to relax for the forced rape they never get to enjoy. 28 days later Sandra Bullock comes in a jet fighter to rescue everyone because they spelled out an SOS message in a field using soiled panties. The End."], "Titanic": ["Boy meets girl. Boat sinks."], "Jeff, Who Lives At Home": ["The guy who's dick is out in Sarah Marshall smokes weed, his brother Ed Helms is a dick, their mom is Susan Sarandon, some dumbass politician drives his family into Hurricane Katrina's vagina, dick guy, Helms and lady save them and cry. Oh and some black guys rob dick guy."], "The Equalizer": ["Denzel kills a bunch of dudes, sponsored by Home Depot."], "The Raid: Redemption ": ["There's a melancholy asian man with a pregnant wife who goes on a raid and finds his bro who is a baddie but a goodie. Lots of shit gets fucked up, loads of asian people die and then they all go home."], "Dhoom 2": ["Indians sing and dance and fuck and fight and I'm pretty sure there's a scene where a guy rollerblades at 90mph."], "Schindler's List": ["Good guy government official gives Jews their own camp to have as a home instead of war-ridden cities. Jews are unhappy, as usual. They start pissing off soldiers, take showers. Little kids hiding in outhouse. Liam Neeson is benevolent. Violin music. Some Jews were saved. The list really didn't do much in the end, I guess."], "Fifty Shades of Grey": ["If you're rich enough than beating a woman is becoming sexy."], "Tombstone": ["Three brothers and a huckleberry move to tombstone and then leave."]}